#!/usr/bin/env python3

#Задача 3.
#С помощью инструментов тестирования Selenium WebDriver (from selenium import webdriver) и Pytest (import pytest) необходимо создать тест, содержащий данные шаги и проверки, описанные ниже.
#1. Перейти по ссылке https://www.a1.by/ru/c/shop 
#2. В блоке Товары по акции выбрать случайным образом блок со смартфоном и нажать на кнопку «Подробнее»
#3. Справа из выпадающего списка выбрать вариант оплаты в рассрочку на 6 месяцев: «6 мес по ххх руб/мес»
#4. Нажать кнопку «Войти и купить»
#5. Вывести сообщение с названием выбранного оборудования и текст выбранного варианта оплаты, включая стоимость. (Например: «Выбран Xiaomi 11T 128GB небесный голубой, вариант оплаты: 6 мес по 229,82 руб/мес»)

print("\n")
print('#' * 80)
print("\n")
print("Aliaksandr Martsinkevich | 2022-10-21 | Stage 2 | Task 2 | Selenium")
print("\n")
print('#' * 80)
print("\n")

print("Задача 3.")
print("С помощью инструментов тестирования Selenium WebDriver (from selenium import")
print("webdriver) и Pytest (import pytest) необходимо создать тест, содержащий данные")
print("шаги и проверки, описанные ниже.")
print("1. Перейти по ссылке https://www.a1.by/ru/c/shop")
print("2. В блоке Товары по акции выбрать случайным образом блок со смартфоном")
print("и нажать на кнопку «Подробнее»")
print("3. Справа из выпадающего списка выбрать вариант оплаты в рассрочку")
print("на 6 месяцев: «6 мес по ххх руб/мес»")
print("4. Нажать кнопку «Войти и купить»")
print("5. Вывести сообщение с названием выбранного оборудования и текст")
print("выбранного варианта оплаты, включая стоимость. (Например: «Выбран")
print("Xiaomi 11T 128GB небесный голубой, вариант оплаты: 6 мес по 229,82 руб/мес»)")

print("\n")
print('-' * 80)
print("\n")


print("\n")
